app/views/letsgos/_letsgo.html.erb

SELECT 1 AS one FROM `letsgos` WHERE `letsgos`.`user_id` = 1 ORDER BY created_at DESC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
---
          <% unless current_user?(letsgo.user) %>
              <% if current_user.interested_users_letsgos.where(:letsgo_id => letsgo.id).present? %>