app/views/users/settings.html.erb

SELECT `subscriptions`.* FROM `subscriptions` WHERE `subscriptions`.`user_id` = 1 ORDER BY `subscriptions`.`id` ASC LIMIT 1
---
		  <h1>Your Subscription</h1>
		  <% if @user.subscription.present? %>