app/views/shared/_header.html.slim

SELECT 1 AS one FROM `subscriptions` WHERE `subscriptions`.`user_id` = 1 AND `subscriptions`.`cancelled` IS NULL LIMIT 1
---
		  ul class="dropdown-menu" role="menu" aria-labelledby="dropdownMenu1" style="position:relative; margin-top: -2px;"
		    - unless Subscription.exists?(user_id: current_user.try(:id) || -1, cancelled: nil)