app/views/subscriptions/new.html.erb

        <h1>Signing up for "<%= @subscription.plan.name %>"</h1>
        <p>Includes <strong><%= @subscription.plan.length %> days</strong> for only <strong><%= number_to_currency @subscription.plan.price %></strong>!</p>
---
SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 12 ORDER BY `plans`.`id` ASC LIMIT 1