app/controllers/letsgos_controller.rb

  def create
    @letsgo = current_user.letsgos.build(letsgo_params)
    if @letsgo.save
---
INSERT INTO `letsgos` (`content`, `created_at`, `tag`, `updated_at`, `user_id`) VALUES ('12/8/2015', '2015-08-11 06:29:32', 'Play', '2015-08-11 06:29:32', 1)