app/controllers/messages_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def create
    @recipient = User.find(params[:user])