app/controllers/photos_controller.rb

INSERT INTO `photos` (`created_at`, `image`, `updated_at`) VALUES ('2015-08-11 06:24:45', 'DSC00962.JPG', '2015-08-11 06:24:45')
UPDATE `photos` SET `user_id` = 1, `updated_at` = '2015-08-11 06:25:15' WHERE `photos`.`id` = 1
SELECT `photos`.* FROM `photos` WHERE `photos`.`user_id` = 1
---
  def create
    @photo = Photo.create(params[:photo])
    @photo.user = current_user
    if @photo.valid? and @photo.save!
      flash[:notice] = "Successfully created photos."
      redirect_to :back
    else
      flash[:notice] = @photo.errors.messages[:base].first

SELECT `photos`.* FROM `photos` WHERE `photos`.`id` = 2 LIMIT 1
DELETE FROM `photos` WHERE `photos`.`id` = 2
---
  def destroy
    @photo = Photo.find(params[:id])
    @photo.destroy