app/controllers/searches_controller.rb

SELECT `locations`.* FROM `locations` WHERE `locations`.`zip_code` = '78200' LIMIT 1
SELECT `searches`.* FROM `searches` WHERE `searches`.`user_id` = 1 ORDER BY `searches`.`id` ASC LIMIT 1
---
  def index
    if current_user.present?
      @user = current_user
      @search = Search.new

      if params["min_age"].present?
        conditions = {}
        range_cond = {}
        conditions[:gender] = params["gender"].join('|') if params["gender"].present?
        conditions[:ethnicity] = params["ethnicity"].join('|') if params["ethnicity"].present?
        if params["zip_code"].present?
          l = Location.find_by_zip_code(params["zip_code"])
          lat = l.latitude * Math::PI / 180.0
          lng = l.longitude * Math::PI / 180.0
        else
          lat = current_user.latitude * Math::PI / 180.0
          lng = current_user.longitude * Math::PI / 180.0
        end
        conditions[:religion] = params["religion"].join('|') if params["religion"].present?
        range_cond[:age] = if params["min_age"].present? and params["max_age"].present?
                             params["min_age"].to_i..params["max_age"].to_i
                           elsif params["min_age"].present?
                             params["min_age"].to_i..65
                           elsif params["max_age"].present?
                             18..params["max_age"].to_i
                           end
        range_cond[:geodist] = 0.0..100_000.0
        conditions[:children] = params["children"].join('|') if params["children"].present?
        @users = if params[:search].present?

SELECT `searches`.* FROM `searches` WHERE `searches`.`user_id` = 1 ORDER BY `searches`.`id` ASC LIMIT 1
---
  def load_search
    @search = current_user.search