app/controllers/sessions_controller.rb

  def create
    user = User.find_by_email(params[:email]) || User.find_by_username(params[:email])
    if user && user.authenticate(params[:password])
      if params[:remember_me]
        cookies.permanent[:auth_token] = user.auth_token
      else
        cookies[:auth_token] = user.auth_token
      end
      user.touch
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'safdar211@gmail.com' LIMIT 1
UPDATE `users` SET `users`.`updated_at` = '2015-08-11 05:33:20' WHERE `users`.`id` = 1