app/controllers/subscriptions_controller.rb

SELECT `plans`.* FROM `plans` WHERE `plans`.`id` = 12 ORDER BY `plans`.`id` ASC LIMIT 1
---
  def new
    plan_id = params[:plan_id] || 12
    plan = Plan.find(plan_id)