app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`username` = '1' LIMIT 1
---
  def settings
    @user = User.find_by(username: params[:id]) || User.find(params[:id])

SELECT `letsgos`.* FROM `letsgos` ORDER BY created_at DESC
SELECT id FROM `users` WHERE (id IN (NULL) AND gender IN ('Female'))
SELECT `searches`.* FROM `searches` WHERE `searches`.`user_id` = 1 ORDER BY `searches`.`id` ASC LIMIT 1
---
  def speed_date
    @letsgo = current_user.letsgos.build
    user_ids = Letsgo.all.map(&:user_id).uniq
    genders = if current_user.gender.downcase == 'male'
				  if current_user.sexuality.downcase == 'gay'
				    ["Male"]
				  elsif current_user.sexuality.downcase == 'straight'
				    ["Female"]
				  else
				    ["Male", "Female"]
				  end
				else
				  if current_user.sexuality.downcase == 'gay'
				    ["Female"]
				  elsif current_user.sexuality.downcase == 'straight'
				    ["Male"]
				  else
				    ["Male", "Female"]
				  end
				end
		   user_ids = User.select(:id).where(["id IN (?) AND gender IN (?)", user_ids, genders]).map(&:id)
           @users = if user_ids.present?
					   User.search(:geo => [current_user.latitude * Math::PI / 180.0, current_user.longitude * Math::PI / 180.0],
						:with  => {:geodist => 0.0..100_000.0, :user_id => user_ids},
						:order => 'geodist ASC', :without => {:user_id => current_user.id}).shuffle

INSERT INTO `users` (`age`, `auth_token`, `birthday`, `created_at`, `email`, `gender`, `password_digest`, `sexuality`, `updated_at`, `username`, `zip_code`) VALUES (29, 'tWdjQTKp4InyLxkZ34kuTA', '1986-08-21', '2015-08-11 05:31:57', 'safdar211@gmail.com', 'Male', '$2a$10$sBb/W6PG.1j82iQ/ktdZuO5GWE0F3.W9vxk0P1q.KY88J2rPz8myq', 'straight', '2015-08-11 05:31:57', 'safdar', '78200')
---
  def create
    if params["user"]["male_sexuality"].present? and params["user"]["female_sexuality"].present?
      params["user"][:sexuality] = 'bisexual'
    elsif params["user"]["male_sexuality"].present?
      params["user"][:sexuality] = 'gay' if params["user"]["gender"] == 'Male'
      params["user"][:sexuality] = 'straight' if params["user"]["gender"] == 'Female'
    elsif params["user"]["female_sexuality"].present?
      params["user"][:sexuality] = 'gay' if params["user"]["gender"] == 'Female'
      params["user"][:sexuality] = 'straight' if params["user"]["gender"] == 'Male'
    end
    @user = User.new(user_params)
    if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`username` = 'safdar' LIMIT 1
SELECT `letsgos`.* FROM `letsgos` WHERE `letsgos`.`user_id` = 1 ORDER BY created_at DESC LIMIT 3 OFFSET 0
---
  def show
    @user = User.find_by(username: params[:id])
    @question = @user.questions.where("answer is not null").order("created_at DESC").page(params[:page]).per_page(3)
    @letsgos = @user.letsgos.paginate(page: params[:page], :per_page => 3)

SELECT `users`.* FROM `users`
SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` ORDER BY created_at DESC LIMIT 4 OFFSET 0
---
  def index
    @user = current_user
    @search = Search.new
    page = params[:page] || 1
    @order = params[:order] || ['age', 'created_at', 'birthday', 'username'].shuffle.first
     if @user.present?
		@users = User.all
        # paginate(:without => {:user_id => @user.id}, :page => page, :per_page => 4, :order => "#{@order} DESC")
	 else
		@users = User.paginate(:page => page, :per_page => 4, :order => "#{@order} DESC")

SELECT `users`.* FROM `users` WHERE `users`.`username` = 'safdar' LIMIT 1
---
   def set_follow
    @user = User.find_by(username: params[:id])